In [1]:
df_a = pd.read_csv("web/data/brand_values.csv")
df_a

        name     value    year  lastValue  rank
0      Apple  214480.0  2018.0   211447.4     1
1      Apple  211447.4  2017.9   208414.8     1
2      Apple  208414.8  2017.8   205382.2     1
3      Apple  205382.2  2017.7   202349.6     1
4      Apple  202349.6  2017.6   199317.0     1
...      ...       ...     ...        ...   ...
18095   Zara       NaN  2004.5        NaN   100
18096   Zara       NaN  2004.6        NaN   100
18097   Zara       NaN  2004.7        NaN   100
18098   Zara       NaN  2004.8        NaN   100
18099   Zara       NaN  2004.9        NaN   100

[18100 rows x 5 columns]

In [2]:
df = pd.read_csv("web/data/covid-data.csv")
df["date"] = pd.to_datetime(df["date"])
df = df.set_index("date")
df = df[["location", "total_cases", "new_cases"]].reset_index()
df["lastValue"] = df["total_cases"] - df["new_cases"]
df = df.rename(columns={"total_cases" : "value", "location" : "name"})
df = df.fillna(0)
df = df.sort_values(["date", "value"], ascending=[True, False])

In [45]:
df = df.groupby(["name", pd.Grouper(key='date', freq='W-MON')]).sum("value").reset_index()
df["lastValue"] = df["value"].shift().fillna(0)
df = df.drop("new_cases", axis=1)
df["rank"] = df.groupby("date").rank(method="max", ascending=False)["value"].astype(int)
df = df.rename(columns={"date":"year"})
df = df[["name", "value", "year", "lastValue", "rank"]]#.to_csv("covid_1.csv")
df["year"] = df["year"].dt.year + df["year"].dt.week/52

<ipython-input-45-5c31a19ae44c>:7: FutureWarning: Series.dt.weekofyear and Series.dt.week have been deprecated.  Please use Series.dt.isocalendar().week instead.
  df["year"] = df["year"].dt.year + df["year"].dt.week/52

In [53]:
df.sort_values("year", ascending=False)

                  name     value         year  lastValue  rank
13341         Zimbabwe  272135.0  2021.423077   270563.0   124
8962   Northern Cyprus       0.0  2021.423077        0.0   216
9029            Norway  869901.0  2021.423077   849443.0    98
9100           Oceania  341245.0  2021.423077   334030.0   118
5057            Guinea  161881.0  2021.423077   160686.0   136
...                ...       ...          ...        ...   ...
11958         Thailand       0.0  2020.057692        0.0     4
9492              Peru       0.0  2020.038462  2433361.0     4
7762            Mexico       0.0  2020.038462     9445.0     4
11957         Thailand       0.0  2020.038462     3563.0     4
475          Argentina       0.0  2020.038462     8811.0     4

[13342 rows x 5 columns]

In [47]:
df.to_csv("covid-dataviz copy/web/data/covid_1.csv")

In [3]:
#df.groupby(["name", pd.Grouper(key='date', freq='W-MON')]).sum("value")

dates = df["date"].unique()
df["rank"] = 0
for day in dates:
    for i in range(len(df[df["date"] == day])):
        df[df["date"] == day].iloc[i]["rank"] = i+1

In [22]:
df_a

        name     value    year  lastValue  rank
0      Apple  214480.0  2018.0   211447.4     1
1      Apple  211447.4  2017.9   208414.8     1
2      Apple  208414.8  2017.8   205382.2     1
3      Apple  205382.2  2017.7   202349.6     1
4      Apple  202349.6  2017.6   199317.0     1
...      ...       ...     ...        ...   ...
18095   Zara       NaN  2004.5        NaN   100
18096   Zara       NaN  2004.6        NaN   100
18097   Zara       NaN  2004.7        NaN   100
18098   Zara       NaN  2004.8        NaN   100
18099   Zara       NaN  2004.9        NaN   100

[18100 rows x 5 columns]

In [23]:
df

              name     value         year  lastValue  rank
0      Afghanistan       1.0  2020.173077        0.0    46
1      Afghanistan       7.0  2020.192308        7.0    63
2      Afghanistan      30.0  2020.211538       24.0    72
3      Afghanistan      93.0  2020.230769       82.0    90
4      Afghanistan     203.0  2020.250000      180.0   109
...            ...       ...          ...        ...   ...
13337     Zimbabwe  267681.0  2021.346154   267490.0   121
13338     Zimbabwe  268751.0  2021.365385   268611.0   123
13339     Zimbabwe  269626.0  2021.384615   269487.0   124
13340     Zimbabwe  270563.0  2021.403846   270439.0   124
13341     Zimbabwe  272135.0  2021.423077   271870.0   124

[13342 rows x 5 columns]

<ipython-input-13-162520f11f11>:1: FutureWarning: Series.dt.weekofyear and Series.dt.week have been deprecated.  Please use Series.dt.isocalendar().week instead.
  df["year"] = df["year"].dt.year + df["year"].dt.week/52

In [17]:
#df["year"] = df["year"].round(1)